; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	thermograph1 - mode
	image0 - mode
	image2 - mode
	GroundStation9 - direction
	GroundStation6 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation8 - direction
	Star7 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image0)
	(supports instrument2 image2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation9)
	(supports instrument3 image2)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument4 image0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 GroundStation6)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 image2)
	(supports instrument6 thermograph1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation8)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation6)
	(supports instrument7 image2)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 Star7)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
)
(:goal (and
	(have_image Phenomenon10 thermograph1)
	(have_image Planet11 image2)
	(have_image Planet12 image0)
	(have_image Planet13 thermograph1)
	(have_image Star14 thermograph1)
	(have_image Phenomenon15 image2)
	(have_image Phenomenon16 thermograph1)
))

)

; plan
1. (turn_to satellite1 groundstation6 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 groundstation6)
   goals met: 0 of 7
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite1 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite1 planet11 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet11)
   goals met: 0 of 7
5. (take_image satellite1 planet11 instrument2 image2)
   added: (have_image planet11 image2)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon16 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 7
7. (take_image satellite1 phenomenon16 instrument2 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 2 of 7
8. (turn_to satellite1 phenomenon15 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon15)
   goals met: 2 of 7
9. (take_image satellite1 phenomenon15 instrument2 image2)
   added: (have_image phenomenon15 image2)
   goals met: 3 of 7
10. (turn_to satellite1 phenomenon10 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 7
11. (take_image satellite1 phenomenon10 instrument2 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 4 of 7
12. (turn_to satellite1 planet12 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet12)
   goals met: 4 of 7
13. (take_image satellite1 planet12 instrument2 image0)
   added: (have_image planet12 image0)
   goals met: 5 of 7
14. (turn_to satellite1 planet13 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet13)
   goals met: 5 of 7
15. (take_image satellite1 planet13 instrument2 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 6 of 7
16. (turn_to satellite1 star14 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star14)
   goals met: 6 of 7
17. (take_image satellite1 star14 instrument2 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 7 of 7
